src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РасчетыСПодотчетниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПодотчетниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснования</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПолисыМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПолисыМедицинскогоСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПолиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаПрикрепления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/ВыборДокументаРасчетов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВидОперации"                , ОтборВидОперации);
	Параметры.Свойство("Контрагент"                 , ОтборКонтрагент);
	Параметры.Свойство("СтруктурнаяЕдиница"         , ОтборСтруктурнаяЕдиница);
	Параметры.Свойство("СостояниеОплаты"            , ОтборСостояниеОплаты);
	Параметры.Свойство("КотрольКонтрагента"         , КонтрольНеобходимостиУказанияКонтрагента);
	Параметры.Свойство("ВыборкаОткрытыхАвансов"     , ВыборкаОткрытыхАвансов);
	Параметры.Свойство("ЗапретМножественногоВыбора" , ЗапретМножественногоВыбора);
	
	ВременныйМассив = Неопределено;
	Параметры.Свойство("ДокументАванс"		   , ОтборДокументАванс);
	Параметры.Свойство("МассивДокументов"      , ВременныйМассив);
	Если ВременныйМассив <> Неопределено Тогда
		ОтборМассивДокументов.ЗагрузитьЗначения(ВременныйМассив);
	КонецЕсли;
	
	// Установка отбора по списку типов документов
	Если Параметры.Свойство("СписокТипов") Тогда
		ОтборСписокТипов.ЗагрузитьЗначения(Параметры.СписокТипов);
	Иначе
		Если ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтКлиента") Тогда			
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.Реализация"));
			ОтборСписокТипов.Вставить(1, Тип("ДокументСсылка.Прием"));
			ОтборСписокТипов.Вставить(2, Тип("ДокументСсылка.НарядЗаказ"));
			ОтборСписокТипов.Вставить(3, Тип("ДокументСсылка.ПланЛечения"));	
			ВидимостьСуммаОплачено = Истина;
			СостояниеОплаты        = 2;
		ИначеЕсли ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании") Тогда
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.Прием"));
			ВидимостьСуммаОплачено = Истина;
			СостояниеОплаты        = 2;
		ИначеЕсли ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Возврат") Тогда
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.Реализация"));
			ОтборСписокТипов.Вставить(1, Тип("ДокументСсылка.Прием"));
			СостояниеОплаты        = 1;
		ИначеЕсли ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыКлиенту") Тогда
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.ВозвратОтПокупателя"));
			СостояниеОплаты        = 2;
		ИначеЕсли ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыСтраховойКомпании") Тогда
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.ВозвратОтПокупателя"));
			ОтборСписокТипов.Вставить(1, Тип("ДокументСсылка.Прием"));
			// СостояниеОплаты        = 2;
		ИначеЕсли ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика") Тогда
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.ВозвратПоставщику"));
			СостояниеОплаты        = 2;
		ИначеЕсли ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаПоставщику") Тогда
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.ЗаказПоставщику"));
			ОтборСписокТипов.Вставить(1, Тип("ДокументСсылка.Поступление"));
			СостояниеОплаты        = 2;
		ИначеЕсли ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника") Тогда
			ОтборСписокТипов.Вставить(0, Тип("ДокументСсылка.СписаниеДенежныхСредств"));
			СостояниеОплаты        = 0;
		КонецЕсли;	
		// Если состояние оплаты явно не указано присвоить значение по виду операции
		ОтборСостояниеОплаты = ?(НЕ ЗначениеЗаполнено(ОтборСостояниеОплаты),СостояниеОплаты,ОтборСостояниеОплаты);		
	КонецЕсли;		
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборКонтрагент) И ТипЗнч(ЭтотОбъект.ОтборКонтрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ТипКонтрагента = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.ОтборКонтрагент, "ТипКонтрагента");		
		НаименованиеТипаКонтрагента = ?(ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты, "пациентом", "контрагентом");
		ЭтаФорма.Заголовок = "Выбор документа расчетов с "+ НаименованиеТипаКонтрагента + ": " + ЭтотОбъект.ОтборКонтрагент;
		
	КонецЕсли;	
	
	ПодготовитьДеревоПодбора();
					
КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы
//
Процедура ПриОткрытии(Отказ)
	
	Если КонтрольНеобходимостиУказанияКонтрагента И НЕ ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		ПоказатьПредупреждение(,"Предварительно укажите контрагента в документе!");
		Отказ = Истина;
	КонецЕсли;
	// Развернуть дерево
	ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ДеревоПодбора,ДеревоПодбора);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор" табличного поля.
//
Процедура Выбрать(Команда)
	
	ВыбранныеДокументы = Новый Массив;
	СтрокиВерхнегоУровня = ДеревоПодбора.ПолучитьЭлементы();
	Для Каждого СтрокаВУ ИЗ СтрокиВерхнегоУровня Цикл
		Если СтрокаВУ.ПризнакВыбора = Истина Тогда 
			СтрокиНижнегоУровня =  СтрокаВУ.ПолучитьЭлементы();
			Если СтрокиНижнегоУровня.Количество() = 0 Тогда
				ВыбранныеДокументы.Добавить(Новый Структура("ДокументОснования,ДокументАванса,Задолженность,Оплачено,СуммаДокумента",СтрокаВУ.ДокументОснования,,СтрокаВУ.Задолженность,СтрокаВУ.Оплачено,СтрокаВУ.СуммаДокумента));
			Иначе
				Для Каждого СтрокаНУ ИЗ СтрокиНижнегоУровня Цикл
					Если СтрокаНУ.ПризнакВыбора = Истина Тогда 
						ВыбранныеДокументы.Добавить(Новый Структура("ДокументОснования,ДокументАванса,Задолженность,Оплачено,СуммаДокумента",СтрокаНУ.ДокументОснования,СтрокаНУ.ДокументАванса,СтрокаНУ.Задолженность,СтрокаНУ.Оплачено,СтрокаНУ.СуммаДокумента));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли; 
	КонецЦикла;
	
	ОповеститьОВыборе(ВыбранныеДокументы);

КонецПроцедуры

&НаКлиенте
// При выборе элемента дерева
Процедура ДеревоПодбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ДеревоПодбора.ТекущиеДанные;
	Если Поле = Элементы.ДеревоПодбораДокументОснования И НЕ ТекущиеДанные = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументАванса) Тогда
			ПоказатьЗначение(,ТекущиеДанные.ДокументОснования);
		Иначе
			ПоказатьЗначение(,ТекущиеДанные.ДокументАванса);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Изменение состояния флажка выбора
Процедура ДеревоПодбораПризнакВыбораПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПодбора.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда			
		СтрокаРодителя = ТекущиеДанные.ПолучитьРодителя();
		
		// Если это элемент верхнего уровня
		Если СтрокаРодителя = Неопределено Тогда
			
			// Если запрщено выбирать более одной строки верхнего уровня
			Если ЗапретМножественногоВыбора = Истина Тогда
				// Проверяем выбор хотя бы одной строки верхнего уровня
				ЭлементыВырехнегоУровня = ДеревоПодбора.ПолучитьЭлементы();
				ВыбранХотябыОдин        = Ложь;
				Для Каждого ЭлементВерхнегоУровня ИЗ ЭлементыВырехнегоУровня Цикл
					Если ЭлементВерхнегоУровня.ПризнакВыбора = Истина Тогда
						ВыбранХотябыОдин = Истина;
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				// Снимаем выбор со всех остальных
				Если ВыбранХотябыОдин = Истина Тогда
					Для Каждого ЭлементВерхнегоУровня ИЗ ЭлементыВырехнегоУровня Цикл
						Если ЭлементВерхнегоУровня <> ТекущиеДанные Тогда
							ЭлементВерхнегоУровня.ПризнакВыбора = Ложь;
							// Дочерние строки
							ЭлементыНижнегоУровня = ЭлементВерхнегоУровня.ПолучитьЭлементы();
							Для Каждого ЭлементНижнегоУровня ИЗ ЭлементыНижнегоУровня Цикл
                                ЭлементыНижнегоУровня.ПризнакВыбора = Ложь;
							КонецЦикла;						
						КонецЕсли;	
					КонецЦикла;					
				Иначе
					ТекущиеДанные.ПризнакВыбора = Истина;
				КонецЕсли;	
			КонецЕсли;
			
			// Снимаем/Проставляем выбор с дочерних элементов 
			ДочерниеСтроки = ТекущиеДанные.ПолучитьЭлементы();
			Для Каждого ЭлементДерева ИЗ ДочерниеСтроки Цикл
				Если НЕ ЭлементДерева.ПризнакВыбора = ТекущиеДанные.ПризнакВыбора Тогда
					ЭлементДерева.ПризнакВыбора = ТекущиеДанные.ПризнакВыбора;
				КонецЕсли;
			КонецЦикла;
			// Если это элемент нижнего уровня	
		Иначе
			ДочерниеСтроки = СтрокаРодителя.ПолучитьЭлементы();
			ПризнакВыбора  = Ложь;
			Для Каждого ЭлементДерева ИЗ ДочерниеСтроки Цикл
				Если ЭлементДерева.ПризнакВыбора = Истина Тогда
					ПризнакВыбора = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			СтрокаРодителя.ПризнакВыбора = ПризнакВыбора;
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
// Процедура подготовки таблицы задолженностей
Процедура ПодготовитьДеревоПодбора()
	
	ДеревоПодбора.ПолучитьЭлементы().Очистить();
	ИтогоЗадолженность               = 0;
	ИтогоОплачено                    = 0;
	ИтогоСуммаДокумента              = 0;
	
	Если ОтборВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента
	 ИЛИ ОтборВидОперации = Перечисления.ВидыОпераций.ОплатаОтСтраховойКомпании Тогда	
	 
		// Получаем таблицу задолженностей	
		ЗапросПоЗадолженности       = Новый Запрос;
		ЗапросПоЗадолженности.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ДокументРеализации КАК ДокументРеализации,
		|	ВложенныйЗапрос.ДокументРеализации.Сотрудник КАК Сотрудник,
		|	ВложенныйЗапрос.ДокументАванса КАК ДокументАванса,
		|	ВложенныйЗапрос.СуммаДокумента КАК СуммаДокумента,
		|	СУММА(ВложенныйЗапрос.Задолженность) КАК Задолженность,
		|	СУММА(ВложенныйЗапрос.Оплачено) КАК Оплачено
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации КАК ДокументРеализации,
		|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации.Сотрудник КАК Сотрудник,
		|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса КАК ДокументАванса,
		|		ВЫБОР
		|			КОГДА НЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации = НЕОПРЕДЕЛЕНО
		|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации.СуммаДокумента
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса ССЫЛКА Документ.НарядЗаказ
		|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса.СуммаПродажи
		|					ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса.СуммаДокумента
		|				КОНЕЦ
		|		КОНЕЦ КАК СуммаДокумента,
		|		СУММА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаОборот) * -1 КАК Задолженность,
		|		СУММА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход) КАК Оплачено
		|	ИЗ
		|		РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
		|				,
		|				&ОтборКонецПериода,
		|				Авто,
		|				,
		|				СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
		|					И (НЕ ДокументРеализации = НЕОПРЕДЕЛЕНО
		|						ИЛИ НЕ ДокументАванса = НЕОПРЕДЕЛЕНО)
		|					И Контрагент = &ОтборКонтрагент) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса,
		|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации,
		|		ВЫБОР
		|			КОГДА НЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации = НЕОПРЕДЕЛЕНО
		|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации.СуммаДокумента
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса ССЫЛКА Документ.НарядЗаказ
		|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса.СуммаПродажи
		|					ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса.СуммаДокумента
		|				КОНЕЦ
		|		КОНЕЦ) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Задолженность > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ДокументАванса,
		|	ВложенныйЗапрос.СуммаДокумента,
		|	ВложенныйЗапрос.ДокументРеализации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументРеализации,
		|	ДокументАванса УБЫВ
		|ИТОГИ ПО
		|	ДокументРеализации";
		
		ЗапросПоЗадолженности.УстановитьПараметр("ОтборКонецПериода"      ,ТекущаяДата());
		ЗапросПоЗадолженности.УстановитьПараметр("ОтборКонтрагент"        ,ОтборКонтрагент);
		ЗапросПоЗадолженности.УстановитьПараметр("ОтборСтруктурнаяЕдиница",ОтборСтруктурнаяЕдиница);
		
		РезЗапВерхнийУровень = ЗапросПоЗадолженности.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ТабЗадолжВерхнийУровень = ДеревоПодбора.ПолучитьЭлементы();
		Пока РезЗапВерхнийУровень.Следующий() Цикл			
			НоваяСтркаВерхнийУровень = Неопределено;
			// Если документом задолженности явялется наряд-заказ или пдан лечения
			Если НЕ ЗначениеЗаполнено(РезЗапВерхнийУровень.ДокументРеализации) Тогда
				РезЗапНижнийУровень = РезЗапВерхнийУровень.Выбрать();
				Пока РезЗапНижнийУровень.Следующий() Цикл
					НоваяСтркаВерхнийУровень                                    = ДеревоПодбора.ПолучитьЭлементы().Добавить();
					НоваяСтркаВерхнийУровень.ПризнакВыбора                      = Истина;
					НоваяСтркаВерхнийУровень.ДокументОснования                  = РезЗапНижнийУровень.ДокументАванса;   
					НоваяСтркаВерхнийУровень.Сотрудник                  		= РезЗапНижнийУровень.Сотрудник;   
					НоваяСтркаВерхнийУровень.ДокументЗадолженностиПредставление = Строка(РезЗапНижнийУровень.ДокументАванса);
					НоваяСтркаВерхнийУровень.СуммаДокумента                     = РезЗапНижнийУровень.СуммаДокумента;
					НоваяСтркаВерхнийУровень.Оплачено                           = РезЗапНижнийУровень.Оплачено;
					НоваяСтркаВерхнийУровень.Задолженность                      = РезЗапНижнийУровень.Задолженность;	
					НоваяСтркаВерхнийУровень.Уровень                            = 0;
					
					ИтогоЗадолженность                                          = ИтогоЗадолженность + НоваяСтркаВерхнийУровень.Задолженность;
					ИтогоСуммаДокумента                                         = ИтогоСуммаДокумента + НоваяСтркаВерхнийУровень.СуммаДокумента;		
					ИтогоОплачено                                               = ИтогоОплачено + НоваяСтркаВерхнийУровень.Оплачено;
				КонецЦикла;
			Иначе
				// Документ в роли док. задолженности любой документ реализации
				// Добовляем строку верхнего уровня
				НоваяСтркаВерхнийУровень = ТабЗадолжВерхнийУровень.Добавить();		
				Если НЕ ЗапретМножественногоВыбора ИЛИ ТабЗадолжВерхнийУровень.Количество() = 1 Тогда
					НоваяСтркаВерхнийУровень.ПризнакВыбора = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(РезЗапВерхнийУровень.ДокументРеализации) Тогда
					НоваяСтркаВерхнийУровень.ДокументОснования              = РезЗапВерхнийУровень.ДокументРеализации;
					НоваяСтркаВерхнийУровень.Сотрудник                  	= РезЗапВерхнийУровень.Сотрудник;   
					НоваяСтркаВерхнийУровень.ДокументЗадолженностиПредставление = Строка(РезЗапВерхнийУровень.ДокументРеализации);
				КонецЕсли;	
				НоваяСтркаВерхнийУровень.СуммаДокумента = 0;
				НоваяСтркаВерхнийУровень.Оплачено       = РезЗапВерхнийУровень.Оплачено;
				НоваяСтркаВерхнийУровень.Задолженность  = РезЗапВерхнийУровень.Задолженность;
				НоваяСтркаВерхнийУровень.Уровень        = 0;
				
				ТабЗадолжНижнийУровень               = НоваяСтркаВерхнийУровень.ПолучитьЭлементы();
				РезЗапНижнийУровень                  = РезЗапВерхнийУровень.Выбрать();
				СчетчикУзлов                         = 0;
				// Добовляем строки нижнего уровня
				Пока РезЗапНижнийУровень.Следующий() Цикл
					// Если документ без аванса дополняем строку верхнего уровня
					Если НЕ ЗначениеЗаполнено(РезЗапНижнийУровень.ДокументАванса) И СчетчикУзлов = 0 Тогда
						НоваяСтркаВерхнийУровень.СуммаДокумента   = РезЗапНижнийУровень.СуммаДокумента;
						НоваяСтркаВерхнийУровень.Оплачено         = РезЗапНижнийУровень.Оплачено;
						НоваяСтркаВерхнийУровень.Задолженность    = РезЗапНижнийУровень.Задолженность;
						Прервать;
					КонецЕсли;
					// Доплняем сумму документа строки верхнего уровня
					НоваяСтркаВерхнийУровень.СуммаДокумента = РезЗапНижнийУровень.СуммаДокумента;
					// Заполняем строки нижнего уровня
					НоваяСтркаНижнийУровень                = ТабЗадолжНижнийУровень.Добавить();
					НоваяСтркаНижнийУровень.ПризнакВыбора  = НоваяСтркаВерхнийУровень.ПризнакВыбора;
					Если ЗначениеЗаполнено(РезЗапНижнийУровень.ДокументРеализации) И НЕ ЗначениеЗаполнено(РезЗапНижнийУровень.ДокументАванса)  Тогда
						НоваяСтркаНижнийУровень.ДокументОснования              = РезЗапНижнийУровень.ДокументРеализации;
						НоваяСтркаНижнийУровень.ДокументЗадолженностиПредставление = Строка("Без основания");
					ИначеЕсли ЗначениеЗаполнено(РезЗапНижнийУровень.ДокументАванса) Тогда
						НоваяСтркаНижнийУровень.ДокументОснования                  = РезЗапНижнийУровень.ДокументРеализации;
						НоваяСтркаНижнийУровень.ДокументАванса                     = РезЗапНижнийУровень.ДокументАванса;
						НоваяСтркаНижнийУровень.ДокументЗадолженностиПредставление = Строка(РезЗапНижнийУровень.ДокументАванса);
					КонецЕсли;	
					НоваяСтркаНижнийУровень.Сотрудник             = РезЗапНижнийУровень.Сотрудник;   
					НоваяСтркаНижнийУровень.Оплачено              = РезЗапНижнийУровень.Оплачено;
					НоваяСтркаНижнийУровень.Задолженность         = РезЗапНижнийУровень.Задолженность;	
					НоваяСтркаНижнийУровень.Уровень               = 1;
					СчетчикУзлов                                  = СчетчикУзлов + 1;
				КонецЦикла;	
				
				ИтогоЗадолженность                                = ИтогоЗадолженность + НоваяСтркаВерхнийУровень.Задолженность;
				ИтогоСуммаДокумента                               = ИтогоСуммаДокумента + НоваяСтркаВерхнийУровень.СуммаДокумента;		
				ИтогоОплачено                                     = ИтогоОплачено    + НоваяСтркаВерхнийУровень.Оплачено;
			КонецЕсли;
		КонецЦикла;	
		
	ИначеЕсли ВыборкаОткрытыхАвансов = Ложь Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументыРеализации.Ссылка КАК ДокументОснования,
		|	ДокументыРеализации.СуммаДокумента КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументыРеализации.СуммаОплачено, 0) КАК Оплачено,
		|	ДокументыРеализации.СуммаДокумента - ЕСТЬNULL(ДокументыРеализации.СуммаОплачено, 0) КАК Задолженность,
		|	ДокументыРеализации.Дата КАК Дата
		|ИЗ
		|	ЖурналДокументов.ДокументыРасчета КАК ДокументыРеализации
		|ГДЕ
		|	ДокументыРеализации.Проведен = ИСТИНА
		|	И ДокументыРеализации.Тип В(&ОтборСписокТипов)
		|	И ВЫБОР
		|			КОГДА &ОтборКонтрагент <> НЕОПРЕДЕЛЕНО
		|					И &ОтборКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ВЫБОР
		|						КОГДА ДокументыРеализации.ПолисМедстрахования <> ЗНАЧЕНИЕ(Справочник.ПолисыМедицинскогоСтрахования.ПустаяССылка)
		|							ТОГДА ДокументыРеализации.ПолисМедстрахования.СтраховаяКомпания = &ОтборКонтрагент
		|						ИНАЧЕ ДокументыРеализации.Контрагент = &ОтборКонтрагент
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборСтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
		|					И &ОтборСтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|				ТОГДА ДокументыРеализации.СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборСостояниеОплаты = 2
		|				ТОГДА ДокументыРеализации.СуммаДокумента - ЕСТЬNULL(ДокументыРеализации.СуммаОплачено, 0) > 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ДокументыРеализации.СуммаДокумента > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыРеализации.Ссылка,
		|	ДокументыРеализации.СуммаДокумента,
		|	ДокументыРеализации.СуммаОплачено,
		|	ДокументыРеализации.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата");
		
		Запрос.УстановитьПараметр("ОтборСписокТипов"         ,ОтборСписокТипов);
		Запрос.УстановитьПараметр("ОтборКонтрагент"          ,ОтборКонтрагент);
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница"  ,ОтборСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ОтборСостояниеОплаты"     ,ОтборСостояниеОплаты);

		РезЗапроса             = Запрос.Выполнить().Выбрать();
		ЭлементыВерхнегоУровня = ДеревоПодбора.ПолучитьЭлементы();
		Пока РезЗапроса.Следующий() Цикл
			НоваяСтрока = ЭлементыВерхнегоУровня.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезЗапроса);
			НоваяСтрока.ДокументЗадолженностиПредставление = Строка(РезЗапроса.ДокументОснования);
			Если НЕ ЗапретМножественногоВыбора ИЛИ ЭлементыВерхнегоУровня.Количество() = 1 Тогда
				НоваяСтрока.ПризнакВыбора                      = Истина;
			КонецЕсли;
			
		    ИтогоЗадолженность                             = ИтогоЗадолженность + НоваяСтрока.Задолженность;
			ИтогоСуммаДокумента                            = ИтогоСуммаДокумента + НоваяСтрока.СуммаДокумента;		
			ИтогоОплачено                                  = ИтогоОплачено    + НоваяСтрока.Оплачено;
		КонецЦикла;
		
	ИначеЕсли ВыборкаОткрытыхАвансов = Истина Тогда	
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Документ КАК ДокументОснования,
		|	ВложенныйЗапрос.Сумма КАК СуммаДокумента
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетыСПодотчетникамиОстаткиИОбороты.ДокументОснования КАК Документ,
		|		РасчетыСПодотчетникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
		|		РасчетыСПодотчетникамиОстаткиИОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		СУММА(РасчетыСПодотчетникамиОстаткиИОбороты.СуммаОборот) КАК Сумма
		|	ИЗ
		|		РегистрНакопления.РасчетыСПодотчетниками.ОстаткиИОбороты(
		|				,
		|				,
		|				Авто,
		|				,
		|				Сотрудник = &ОтборСотрудник
		|					И СтруктурнаяЕдиница = &ОтборСтруктурнаяЕдиница
		|					И ДокументОснования <> ЗНАЧЕНИЕ(Документ.СписаниеДенежныхСредств.ПустаяСсылка)
		|					И НЕ ДокументОснования В (&ОтборМассивДокументов)) КАК РасчетыСПодотчетникамиОстаткиИОбороты
		|	ГДЕ
		|		РасчетыСПодотчетникамиОстаткиИОбороты.Регистратор <> &ОтборРегистратор
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РасчетыСПодотчетникамиОстаткиИОбороты.ДокументОснования,
		|		РасчетыСПодотчетникамиОстаткиИОбороты.Сотрудник,
		|		РасчетыСПодотчетникамиОстаткиИОбороты.СтруктурнаяЕдиница) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Сумма > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Документ.Дата");
		
		Запрос.УстановитьПараметр("ОтборРегистратор"        ,ОтборДокументАванс);
		Запрос.УстановитьПараметр("ОтборСотрудник"          ,ОтборКонтрагент);
		Запрос.УстановитьПараметр("ОтборСтруктурнаяЕдиница" ,ОтборСтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ОтборМассивДокументов"   ,ОтборМассивДокументов);
		
		РезЗапроса             = Запрос.Выполнить().Выбрать();
		ЭлементыВерхнегоУровня = ДеревоПодбора.ПолучитьЭлементы();
		Пока РезЗапроса.Следующий() Цикл
			НоваяСтрока = ЭлементыВерхнегоУровня.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезЗапроса);
			НоваяСтрока.ДокументЗадолженностиПредставление = Строка(РезЗапроса.ДокументОснования);
			Если НЕ ЗапретМножественногоВыбора ИЛИ ЭлементыВерхнегоУровня.Количество() = 1 Тогда
				НоваяСтрока.ПризнакВыбора                      = Истина;
			КонецЕсли;
			
			ИтогоСуммаДокумента                            = ИтогоСуммаДокумента + НоваяСтрока.СуммаДокумента;		
		КонецЦикла;			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодбораУстановитьСнятьГалочки(Команда)
	
	ВыбратьВсе = Команда.Имя = "ДеревоПодбораУстановитьГалочки";
	// Установка состояния флажков
	Для Каждого СтрокаВерхнийУровень ИЗ ДеревоПодбора.ПолучитьЭлементы() Цикл		
		СтрокаВерхнийУровень.ПризнакВыбора = ВыбратьВсе;
		Для Каждого СтрокаНижнийуровень ИЗ СтрокаВерхнийУровень.ПолучитьЭлементы() Цикл
			СтрокаНижнийуровень.ПризнакВыбора = ВыбратьВсе;  
		КонецЦикла;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
// Процедура - Дерево подбора сортирока по убыванию.
//
Процедура ДеревоПодбораСортирокаПоУбыванию(Команда)
	
	Если НЕ Элементы.ДеревоПодбора.ТекущийЭлемент = Неопределено И
		ЗначениеЗаполнено(Элементы.ДеревоПодбора.ТекущийЭлемент.Имя) И
		НЕ Элементы.ДеревоПодбора.ТекущийЭлемент.Имя = "ДеревоПодбораПризнакВыбора" Тогда

		ДеревоПодбораСортирокаНаСервере(Элементы.ДеревоПодбора.ТекущийЭлемент.Имя, "Убыв");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Дерево подбора сортирока по возрастанию.
//
Процедура ДеревоПодбораСортирокаПоВозрастанию(Команда)
		
	Если НЕ Элементы.ДеревоПодбора.ТекущийЭлемент = Неопределено И
		ЗначениеЗаполнено(Элементы.ДеревоПодбора.ТекущийЭлемент.Имя) И
		НЕ Элементы.ДеревоПодбора.ТекущийЭлемент.Имя = "ДеревоПодбораПризнакВыбора" Тогда
		
		ДеревоПодбораСортирокаНаСервере(Элементы.ДеревоПодбора.ТекущийЭлемент.Имя, "Возр");
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
// Процедура - Дерево подбора сортирока на сервере.
//
Процедура ДеревоПодбораСортирокаНаСервере(НаименованиеКолонки, СортировкаНаправление)
	
	ПриведенноеНаименованиеКолонки = Сред(НаименованиеКолонки, 14);
	
	ДЗ = ДанныеФормыВЗначение(ДеревоПодбора, Тип("ДеревоЗначений"));
	ДЗ.Строки.Сортировать(ПриведенноеНаименованиеКолонки + " " + СортировкаНаправление, Истина);
	ЗначениеВДанныеФормы(ДЗ, ДеревоПодбора);
	
КонецПроцедуры


#КонецОбласти
